app/Nova/Menu/MenuItemPageType.php

    public static function getValue($value, ?array $data, $locale)
    {
        return \App\Models\Page::find($value)?->URL;
---
SELECT * FROM `pages` WHERE `pages`.`id` = '2' LIMIT 1