app/Nova/Page.php

SELECT `title`, `id` FROM `pages` WHERE `language_id` IS NULL and `id` IS not NULL ORDER BY `title` ASC
---
        ];

        if ($this->template !== "home-page") {
            $fields = array_merge($fields, [
                Select::make("Parent page", "parent_id")
                    ->options(
                        \App\Models\Page::where(
                            "language_id",
                            $this->language_id
                        )
                            ->where("id", "!=", $this->id)
                            ->orderBy("title")
                            ->pluck("title", "id")
                    )
                    ->nullable()
                    ->hideFromIndex(),
            ]);