app/Http/Controllers/PageController.php

    public function show(Language $language = null, $slug = null)
    {
        $slug_parts = explode("/", $slug);

        if ($language) {
            if (
                is_numeric($slug) &&
                \App\Models\Podcast::where("episode_number", $slug)->first()
            ) {
                $slug = \App\Models\Podcast::where(
                    "episode_number",
                    $slug
                )->first()->slug;
                return redirect()->route("language.podcast.show", [
                    "podcast" => $slug,
                    "language" => $language,
                ]);
            } elseif (
                !strpos($slug, "/") &&
                \App\Models\Post::where("slug", $slug)->first()
            ) {
                return redirect()->route("language.post.show", [
                    "post" => $slug,
                    "language" => $language,
                ]);
            } else {
                $page = $language
                    ->pages()
                    ->where("slug", end($slug_parts) ?: "/")
                    ->firstOrFail();
---
SELECT * FROM `pages` WHERE `pages`.`language_id` = 1 and `pages`.`language_id` IS not NULL and `slug` = '/' LIMIT 1

                    "language" => $language,
                ]);
            } else {
                $page = Page::doesntHave("language")
                    ->where("slug", end($slug_parts) ?: "/")
                    ->firstOrFail();
---
SELECT * FROM `pages` WHERE not exists (SELECT * FROM `languages` WHERE `pages`.`language_id` = `languages`.`id`) and `slug` = '/' LIMIT 1