app/Nova/Flexible/Layouts/LanguagesPostsLinks.php

    public function getLanguagesAttribute()
    {
        return \App\Models\Language::find($this->__get("languages_ids"));
---
SELECT * FROM `languages` WHERE `languages`.`id` in (1, 2)