app/Models/Page.php

SELECT * FROM `pages` WHERE `pages`.`id` = 10 and `language_id` IS NULL LIMIT 1
---
    public function parent()
    {
        return $this->belongsTo(\App\Models\Page::class, "parent_id")->where(
            "language_id",
            $this->language_id
        );

SELECT `id`, `title`, `parent_id`, `slug`, `language_id` FROM `pages`
---
    public function scopeOrderPagesByUrl($query)
    {
        $ids_ordered = implode(
            ",",
            \App\Models\Page::withoutGlobalScopes()
                ->select("id", "title", "parent_id", "slug", "language_id")
                ->get()
                ->sortBy([["language_id", "asc"], ["URL", "asc"]])
                ->pluck("id")
                ->toArray()
        );

SELECT * FROM `pages` WHERE `language_id` IS NULL and `template` = 'App\\Nova\\Templates\\PostsPageTemplate' LIMIT 1
---
    public static function getTemplateUrl($template, $language_id = null)
    {
        return \App\Models\Page::where("language_id", $language_id)->firstWhere(
            "template",
            $template
        )?->url;